DataProcessors/ПомощникНастройкиОбменаУРМК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>ПомощникНастройкиОбменаУРМК</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ТипыСпособовОплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыСпособовОплат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Эквайринг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮKassa</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДругаяПлатежнаяСистема</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СпособыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>СпособыОплаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьБезПодключенияОборудования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эквайрер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетЭквайринг</Name>
					<Comment>Банковский счет для эквайринговых операций</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьВНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Патент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Патенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобственныеНастройкиНалоговогоУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДляКредита</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДляОплатыСБП</Name>
					<Comment>Служебный реквизит, необходим для разделения эквайринговых теминалов на способы оплаты платежных систем</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСпособовОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыПлатежныхКарт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПлатежнойКарты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентКомиссииПриОтмене</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентКомиссииПриВозврате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлатежнаяСистема</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыПлатежнойСистемыККТ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ПомощникНастройкиОбменаУРМК/Forms/НастройкаРежима/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьСвойстваФормы();
	
	РазрешенРасширенныйРежимНастройки =
		ИнтеграцияУРМКПереопределяемый.РазрешенРасширенныйРежимНастройкиОбменаУРМК();
		
	Если Не РазрешенРасширенныйРежимНастройки Тогда
		ИспользоватьРасширенныйРежимНастройкиУРМК = Ложь;
		УпрощенныйРежимНастройкиУРМКПриИзмененииНаСервере();
		
	КонецЕсли;
	
	ИспользоватьРасширенныйРежимНастройкиУРМК =
		ИнтеграцияУРМКСлужебный.ИспользоватьРасширенныйРежимНастройкиУРМК();
		
	БлокировкаСнятияРасширенногоРежима = БлокировкаСнятияРасширенногоРежимаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьФорму();
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновлениеОтборовНаУзле" Тогда
		БлокировкаСнятияРасширенногоРежима = БлокировкаСнятияРасширенногоРежимаНаСервере();
		НастроитьФорму();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УпрощенныйРежимНастройкиУРМКПриИзменении(Элемент)
	
	УпрощенныйРежимНастройкиУРМКПриИзмененииНаСервере();
	
	НастроитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиНажатие(Элемент)
	
	Если Элемент.Имя = "НастройкиУРМК" Тогда
		
		ОткрытьФорму("Обработка.ПомощникНастройкиОбменаУРМК.Форма.ПомощникНастройкиОбменаДанными");
		
	ИначеЕсли Элемент.Имя = "СпособыОплаты" Тогда

		УстановитьОпцииДляРаботыПодсистемы();
		
		ТипыПлатежныхСистем = Новый Массив;
		ТипыПлатежныхСистем.Добавить(ПредопределенноеЗначение("Перечисление.ТипыСпособовОплат.СБП"));
		ТипыПлатежныхСистем.Добавить(ПредопределенноеЗначение("Перечисление.ТипыСпособовОплат.ЮKassa"));

		ТипыПлатежныхСистем = Новый ФиксированныйМассив(ТипыПлатежныхСистем);
		Отбор 				= Новый Структура("Тип", ТипыПлатежныхСистем);
		
		ОткрытьФорму("Справочник.СпособыОплаты.Форма.ФормаСписка", Новый Структура("РежимПлатежнойСистемы, Отбор", Истина, Отбор));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УРМКНажатие(Элемент)
	ОткрытьФорму("Справочник.УниверсальныеРабочиеМестаКассиров.ФормаСписка");
КонецПроцедуры

#КонецОбласти

#Область ИнициализацияФормыПриСоздании

&НаСервере
Процедура ИнициализироватьСвойстваФормы()
	
	Заголовок = НСтр("ru = 'Режим настройки обмена с 1С:РМК, 1С:Касса, 1С:Мобильная касса'");
	ОпределенитьНомерОбласти();
	ЭтоБизнесПриложение = ВозможностиПриложения.ЭтоБизнесПриложение(НомерТекущейОбласти);
	Если ЭтоБизнесПриложение Тогда
		ИмяСлужебногоПользователя = ИмяСлужебногоПользователяОбмена(НомерТекущейОбласти);
		СлужебныйПользовательОбмена(ИмяСлужебногоПользователя);
		АдресПрограммы = АдресПубликацииПриложения(НомерТекущейОбласти);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УпрощенныйРежимНастройкиУРМКПриИзмененииНаСервере()
	
	Константы.ИспользоватьРасширенныйРежимНастройкиУРМК.Установить(ИспользоватьРасширенныйРежимНастройкиУРМК);
	
КонецПроцедуры

&НаСервере
Функция БлокировкаСнятияРасширенногоРежимаНаСервере()
	Возврат ИнтеграцияУРМКСлужебный.БлокировкаСнятияРасширенногоРежима();
КонецФункции
	
&НаСервере
Процедура УстановитьОпцииДляРаботыПодсистемы()
	ИнтеграцияСПлатежнымиСистемамиУНФ.УстановитьОпцииДляРаботыПодсистемы();
КонецПроцедуры

#Область НастройкиСинхронизацииБизнесПриложение
&НаКлиенте
Процедура НастроитьЭлементыБизнесПриложения()
	Элементы.ГруппаДанныеСлужебногоПользователя.Видимость = ЭтоБизнесПриложение; 
	УстановитьДоступностьНастроек(НЕ ЭтоБизнесПриложение);
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьНастроек(ЗначениеДоступности)
	Элементы.ГруппаНастроекРежима.Доступность = ЗначениеДоступности;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяСлужебногоПользователяОбмена(НомерТекущейОбласти)
			
	Возврат "Exchange_" + Формат(НомерТекущейОбласти,"ЧГ=");
	
КонецФункции

&НаСервере
Процедура ОпределенитьНомерОбласти()
	
	НомерТекущейОбласти = 0;
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
		СеансЗапущенБезРазделителей = МодульРаботаВМоделиСервиса.СеансЗапущенБезРазделителей();
		Если НЕ СеансЗапущенБезРазделителей Тогда
			НомерТекущейОбласти = МодульРаботаВМоделиСервиса.ЗначениеРазделителяСеанса();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция АдресПубликацииПриложения(НомерТекущейОбласти)
	
	АдресПубликации = Константы.АдресПубликацииИнформационнойБазыВИнтернете.Получить();
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
		СеансЗапущенБезРазделителей = МодульРаботаВМоделиСервиса.СеансЗапущенБезРазделителей();
		Если НЕ СеансЗапущенБезРазделителей Тогда
			Попытка
				МодульПрограммныйИнтерфейсСервиса = ОбщегоНазначения.ОбщийМодуль("ПрограммныйИнтерфейсСервиса");
				СвойстваПриложения = МодульПрограммныйИнтерфейсСервиса.СвойстваПриложения(НомерТекущейОбласти);
				АдресПубликации = СвойстваПриложения.АдресПриложения;
			Исключение
				АдресПубликации = "";
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат АдресПубликации;
	
КонецФункции

&НаСервере
Процедура СлужебныйПользовательОбмена(ИмяПользователя)
	
	ПользовательСсылка = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователя, Истина);
	
	Если НЕ ПользовательСсылка.Пустая() Тогда
		
		ИдентификаторПользователяИБ = ПользовательСсылка.ИдентификаторПользователяИБ;

		УстановитьПривилегированныйРежим(Истина);
		ПользовательОбменаИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
		УстановитьПривилегированныйРежим(Ложь);
		
		Если ПользовательОбменаИБ <> Неопределено Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Пароль = НовыйПароль();
	
	ОписаниеПользователяИБ = Пользователи.НовоеОписаниеПользователяИБ();
	ОписаниеПользователяИБ.Имя = ИмяПользователя;
	ОписаниеПользователяИБ.ПолноеИмя = ИмяПользователя;
	ОписаниеПользователяИБ.АутентификацияСтандартная = Истина;
	ОписаниеПользователяИБ.ПоказыватьВСпискеВыбора = Ложь;
	ОписаниеПользователяИБ.Пароль = Пароль;
	ОписаниеПользователяИБ.Вставить("Действие", "Записать");
	ОписаниеПользователяИБ.Роли = Новый Массив;
	
	ОписаниеПользователяИБ.Роли.Добавить(Метаданные.Роли.ВыполнениеСинхронизацииДанных.Имя);
	ОписаниеПользователяИБ.Роли.Добавить(Метаданные.Роли.УдаленныйДоступБазоваяФункциональность.Имя);
	
	ИспользоватьСерверЛояльности = Константы.ИспользоватьСерверЛояльностиПоставщикДанных.Получить();
	Если ИспользоватьСерверЛояльности Тогда
		ОписатьПрофиль_СерверЛояльности(ОписаниеПользователяИБ);
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.Пользователи");
		БлокировкаДанных.Заблокировать();
		
		Если НЕ ПользовательСсылка.Пустая() Тогда
			ПользовательОбъект = ПользовательСсылка.ПолучитьОбъект();
		Иначе
			ПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
			ПользовательОбъект.Наименование = ИмяПользователя;
			ПользовательОбъект.Недействителен = Ложь;
			ПользовательОбъект.Служебный = Истина;
		КонецЕсли;
		ПользовательОбъект.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);
		ПользовательОбъект.Записать();
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Ошибка создания пользователя.'", КодОсновногоЯзыка),
			УровеньЖурналаРегистрации.Ошибка,,,
			ОписаниеОшибки);
		ТекстСообщенияПользователю = ОбработкаОшибок.СообщениеОбОшибкеДляПользователя(ИнформацияОбОшибке());
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияПользователю);
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ОписатьПрофиль_СерверЛояльности(ОписаниеПрофиля)
	
	ОписаниеПрофиля.Роли.Добавить(Метаданные.Роли.БазовыеПраваСерверЛояльности.Имя);
	ОписаниеПрофиля.Роли.Добавить(Метаданные.Роли.БазовыеПраваПриложения.Имя);
	ОписаниеПрофиля.Роли.Добавить(Метаданные.Роли.БазовыеПраваБСП.Имя);
	ОписаниеПрофиля.Роли.Добавить(Метаданные.Роли.ЧтениеСерверЛояльности.Имя);
	ОписаниеПрофиля.Роли.Добавить(Метаданные.Роли.ДобавлениеИзменениеСерверЛояльности.Имя);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НовыйПароль()
	
	МинимальнаяДлинаПароля = ПолучитьМинимальнуюДлинуПаролейПользователей();
	Если МинимальнаяДлинаПароля <= 8 Тогда
		МинимальнаяДлинаПароля = 8;
	КонецЕсли;
	ПараметрыПароля = ПользователиСлужебный.ПараметрыПароля(МинимальнаяДлинаПароля, Истина);
	Возврат ПользователиСлужебный.СоздатьПароль(ПараметрыПароля);
	
КонецФункции

&НаКлиенте
Процедура СгенерироватьНовыйПароль(Команда)
	УстановитьНовыйПарольНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьНовыйПарольНаСервере()
	
	ПользовательСсылка = Справочники.Пользователи.НайтиПоНаименованию(ИмяСлужебногоПользователя, Истина);
	Если НЕ ПользовательСсылка.Пустая() Тогда
		НачатьТранзакцию();
		Попытка
			
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.Пользователи");
			БлокировкаДанных.Заблокировать();
			ПользовательКУдалению = ПользовательСсылка.ПолучитьОбъект();
			
			ОписаниеПользователяИБ = Пользователи.НовоеОписаниеПользователяИБ();
			ОписаниеПользователяИБ.Вставить("Действие", "Удалить");
			
			ПользовательКУдалению.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);
			ПользовательКУдалению.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			
			ОтменитьТранзакцию();
			ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Ошибка генерации пользователя.'", КодОсновногоЯзыка),
				УровеньЖурналаРегистрации.Ошибка,,,
				ОписаниеОшибки);
			ТекстСообщенияПользователю = ОбработкаОшибок.СообщениеОбОшибкеДляПользователя(ИнформацияОбОшибке());
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияПользователю);
			
		КонецПопытки;
	КонецЕсли;
	
	СлужебныйПользовательОбмена(ИмяСлужебногоПользователя);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанныеПользователя(Команда)
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("СохранитьФайлСДаннымиАвторизации", ЭтаФорма);
	ПоказатьВопрос(ОповещениеОЗакрытии, НСтр("ru = 'Сохранить настройки в файл?'"),РежимДиалогаВопрос.ДаНет);
	УстановитьДоступностьНастроек(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлСДаннымиАвторизации(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	АдресФайла = СкачатьФайлСДаннымиАвторизацииНаСервере();
	
	Оповещение = Новый ОписаниеОповещения("СкачатьДанныеАвторизацииЗавершение", ЭтотОбъект, Новый Структура);
	Оповещение.ДополнительныеПараметры.Вставить("АдресФайла", АдресФайла);
	
	ПараметрыСохранения = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
	ПараметрыСохранения.Диалог.Заголовок = НСтр("ru = 'Сохранить данные авторизации для 1С:РМК'");
	ПараметрыСохранения.Диалог.Фильтр = "Документ txt (*.txt)|*.txt";
	
	ФайловаяСистемаКлиент.СохранитьФайл(
		Оповещение,
		АдресФайла,
		НСтр("ru = 'Данные авторизации для РМК.txt'"),
		ПараметрыСохранения);
КонецПроцедуры
	
&НаСервере
Функция СкачатьФайлСДаннымиАвторизацииНаСервере()
	
	ИмяФайла = ПолучитьИмяВременногоФайла("txt");
	
	ДанныеАвторизацииТекст = СформироватьДокументДанныеАвторизации();
	ДанныеАвторизацииТекст.Записать(ИмяФайла);
	
	АдресФайла = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайла), УникальныйИдентификатор);
	
	Попытка
		УдалитьФайлы(ИмяФайла);
	Исключение
		
		ТекстОшибки = НСтр("ru = 'Ошибка удаления временного файла по причине:'") + Символы.ПС 
			+ ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
	
	Возврат АдресФайла;
	
КонецФункции

&НаСервере
Функция СформироватьДокументДанныеАвторизации()
	
	ТекстЗаголовка = НСтр("ru = 'Данные для авторизации при подключении программы 1С:РМК к приложению.'");
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ТекстЗаголовка);
	ТекстовыйДокумент.ДобавитьСтроку("Адрес программы: " + АдресПрограммы);
	ТекстовыйДокумент.ДобавитьСтроку("Пользователь: " + ИмяСлужебногоПользователя);
	
	Если ЗначениеЗаполнено(Пароль) Тогда
		ТекстовыйДокумент.ДобавитьСтроку("Пароль: " + Пароль);
	Иначе
		ТекстовыйДокумент.ДобавитьСтроку("Пароль: <пароль установлен ранее> - если не помните, то установите новый пароль.");
	КонецЕсли;
	
	Возврат ТекстовыйДокумент;
	
КонецФункции

&НаКлиенте
Процедура СкачатьДанныеАвторизацииЗавершение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт
	
	УдалитьИзВременногоХранилища(ДополнительныеПараметры.АдресФайла);
	
	Если ПолученныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеОткрытияФайла = Новый ОписаниеОповещения(
		"ФайлДанныеАвторизацииСохраненЗавершение",
		ЭтотОбъект,
		Новый Структура("ПутьКФайлу",  ПолученныеФайлы[0].ПолноеИмя));
	
	ПоказатьОповещениеПользователя(
		НСтр("ru = 'Файл успешно сохранен'"),
		ОповещениеОткрытияФайла,
		ПолученныеФайлы[0].ПолноеИмя,
		БиблиотекаКартинок["Информация32"]);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлДанныеАвторизацииСохраненЗавершение(ДополнительныеПараметры) Экспорт
	
	ФайловаяСистемаКлиент.ОткрытьФайл(ДополнительныеПараметры.ПутьКФайлу);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбщиеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьФорму()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПолеФлажкаРасширенныйРежим",
		"Доступность",
		 Не БлокировкаСнятияРасширенногоРежима);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"Прочее",
		"Видимость",
		ИспользоватьРасширенныйРежимНастройкиУРМК);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаДекорацияКомментарийДоступности",
		"Видимость",
		БлокировкаСнятияРасширенногоРежима);

	КомментарийДоступности =
		НСтр("ru = 'Отключение расширенного режима настройки недоступно, потому что:
		|- существуют Универсальные рабочие места с двумя подключенными кассами ККМ.'");

	Если БлокировкаСнятияРасширенногоРежима Тогда
		Элементы.ДекорацияКомментарийДоступности.Подсказка = КомментарийДоступности;
	КонецЕсли;
	
	НастроитьЭлементыБизнесПриложения();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКомментарийДоступностиНажатие(Элемент)
	
	ТекстСообщения = Элемент.Подсказка;
	ПоказатьПредупреждение(, ТекстСообщения);

КонецПроцедуры

#КонецОбласти
